'''
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict. 
'''

print('Вариант на списке:')
month = int(input('Введите номер месяца: '))
months = ['', 'январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август',
'сентябрь', 'октябрь', 'ноябрь', 'декабрь']
print(f'Месяц под номером {month} это {months[month]}')

print('\n')

print('Вариант на словаре:')
month = int(input('Введите номер месяца: '))
months = {1: 'январь', 2: 'февраль', 3: 'март', 4: 'апрель', 5: 'май', 6: 'июнь', 7: 'июль', 8: 'август',
9: 'сентябрь', 10: 'октябрь', 11: 'ноябрь', 12: 'декабрь'}
print(f'Месяц под номером {month} это {months.get(month)}')

